[Killed] PublicVisibility
CalculationDV.php:9:5
 
 final class CalculationDV
 {
-    public static function bradescoAgency(string $agency): int
+    protected static function bradescoAgency(string $agency) : int
     {
         /** @var int $digit */
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.46762c08a5f86b56576d53311be3ea55.infection.xml

E.EEEEEEE..........                                               19 / 19 (100%)

Time: 00:00.106, Memory: 28.00 MB

[Killed] PublicVisibility
CalculationDV.php:20:5
         return $digit;
     }
 
-    public static function bradescoAccount(string $account): int
+    protected static function bradescoAccount(string $account) : int
     {
         /** @var int $digit */
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.0289b0a16a96b3302d74232c40e54e12.infection.xml

E.EEE.EEEE.........                                               19 / 19 (100%)

Time: 00:00.106, Memory: 28.00 MB
