[Killed] PublicVisibility
Useful.php:11:5
 
 final class Useful
 {
-    public static function onlyNumbers(string $string): string
+    protected static function onlyNumbers(string $string) : string
     {
         /** @var string $return */
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.322f501b76fe4b95660aa302d7729e51.infection.xml

EEEEEEEEE........................                                 33 / 33 (100%)

Time: 00:00.134, Memory: 28.00 MB

[Killed] PublicVisibility
Useful.php:19:5
         return $return;
     }
 
-    public static function upper(string $string): string
+    protected static function upper(string $string) : string
     {
         return strtr(mb_strtoupper($string), 'àáâãäåæçèéêëìíîïðñòóôõö÷øùüúþÿ', 'ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÜÚÞß');
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.a2bfb39d9b05b64d9b610d9904b77553.infection.xml

E................................                                 33 / 33 (100%)

Time: 00:00.137, Memory: 28.00 MB

[Killed] DecrementInteger
Useful.php:24:5
         return strtr(mb_strtoupper($string), 'àáâãäåæçèéêëìíîïðñòóôõö÷øùüúþÿ', 'ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÜÚÞß');
     }
 
-    public static function formatCnab(string $tipo, string $valor, int $tamanho, int $dec = 0, string $sFill = ''): string
+    public static function formatCnab(string $tipo, string $valor, int $tamanho, int $dec = -1, string $sFill = '') : string
     {
         if ($dec < 0) {
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.8356ba6ff6a1a791b6c2432207949f24.infection.xml

EF

Time: 00:00.055, Memory: 26.00 MB

[Killed] IncrementInteger
Useful.php:24:5
         return strtr(mb_strtoupper($string), 'àáâãäåæçèéêëìíîïðñòóôõö÷øùüúþÿ', 'ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÜÚÞß');
     }
 
-    public static function formatCnab(string $tipo, string $valor, int $tamanho, int $dec = 0, string $sFill = ''): string
+    public static function formatCnab(string $tipo, string $valor, int $tamanho, int $dec = 1, string $sFill = '') : string
     {
         if ($dec < 0) {
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.cd10644093d1c5bc752797f51c5a1921.infection.xml

F

Time: 00:00.054, Memory: 26.00 MB

[Killed] LessThan
Useful.php:26:9
 
     public static function formatCnab(string $tipo, string $valor, int $tamanho, int $dec = 0, string $sFill = ''): string
     {
-        if ($dec < 0) {
+        if ($dec <= 0) {
             throw new Exception('Decimais não pode ser menor que 0');
         }
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.b4e761184d52120b83be5905c626230e.infection.xml

EF

Time: 00:00.058, Memory: 26.00 MB

[Killed] LessThanNegotiation
Useful.php:26:9
 
     public static function formatCnab(string $tipo, string $valor, int $tamanho, int $dec = 0, string $sFill = ''): string
     {
-        if ($dec < 0) {
+        if ($dec >= 0) {
             throw new Exception('Decimais não pode ser menor que 0');
         }
statusReason: PHPUnit 10.5.36 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.3.14
Configuration: /tmp/infection/phpunitConfiguration.9a53cc602fea7ba0403f604ac82c14eb.infection.xml

EF

Time: 00:00.056, Memory: 26.00 MB
